Revit 2026 API

# WireMaterialTypeGroundConductorSizes Property

---

Get all ground conductor size types defined in this wire material type.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public GroundConductorSizeSet GroundConductorSizes { get; }
```
```vb
Public ReadOnly Property GroundConductorSizes As GroundConductorSizeSet
	Get
```
```cpp
public:
property GroundConductorSizeSet^ GroundConductorSizes {
	GroundConductorSizeSet^ get ();
}
```
```fsharp
member GroundConductorSizes : GroundConductorSizeSet with get
```

#### Property Value

GroundConductorSizeSet

#### Reference

WireMaterialType Class

Autodesk.Revit.DB.Electrical Namespace